```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ingest_asset_reconciler_environments["intg"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "intg"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_environments["intg"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "intg"
      + id          = (known after apply)
      + repository  = "dr2-ingest-asset-reconciler"

      + reviewers {}
    }

  # module.ingest_asset_reconciler_environments["mgmt"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "mgmt"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_environments["mgmt"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "mgmt"
      + id          = (known after apply)
      + repository  = "dr2-ingest-asset-reconciler"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_asset_reconciler_environments["prod"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "prod"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_environments["prod"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "prod"
      + id          = (known after apply)
      + repository  = "dr2-ingest-asset-reconciler"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_asset_reconciler_environments["sbox"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "sbox"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_environments["sbox"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "sbox"
      + id          = (known after apply)
      + repository  = "dr2-ingest-asset-reconciler"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_asset_reconciler_environments["staging"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "staging"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_environments["staging"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "staging"
      + id          = (known after apply)
      + repository  = "dr2-ingest-asset-reconciler"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_asset_reconciler_lambda.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "MANAGEMENT_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_lambda.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.ingest_asset_reconciler_lambda.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-asset-reconciler"
      + secret_name     = "WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```